Revit 2027 API
AnalysisDisplayVectorSettings.VectorPosition Property
 Vector position.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public AnalysisDisplayStyleVectorPosition VectorPosition { get; set; }
Public Property VectorPosition As AnalysisDisplayStyleVectorPosition
	Get
	Set
public:
property AnalysisDisplayStyleVectorPosition VectorPosition {
	AnalysisDisplayStyleVectorPosition get ();
	void set (AnalysisDisplayStyleVectorPosition value);
}
member VectorPosition : AnalysisDisplayStyleVectorPosition with get, set
Property Value
AnalysisDisplayStyleVectorPosition
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
AnalysisDisplayVectorSettings Class
Autodesk.Revit.DB.Analysis Namespace